module.exports = class extends require('../base') {
    constructor() {
        super();
        this._collection = [
            '鸿琳', '鸿玉', '鸿玲', '玲彤', '微竹', '轩', '先锋', '志均', 
            '麟', '航', '思烨', '栋', '彦霏', '柳', '彦霖', '宇', '硕', 
            '辉', '无名', '彦博', '钰珏', '锶慧', '锶妍', '曦哲', '钰颖', 
            '姿汐', '岳丹', '姿淇', '锶罕', '钰涵', '锶涵', '栎', '肖昰', 
            '萧', '锶瑶', '曌', '岩', '羲', '曦', '西', '然', '皓', 
            '嘉昇', '烨荪', '潭凭', '文泽', '淑瑶', '仲源', '昊瀚', '浩瀚', 
            '嘉乐', '子涵', '亦涵', '皓轩', '亚烁', '有昊', '大发', '赫郝', 
            '嘉靖', '逸轩', '尹轩', '睿', '星睿', '佳睿', '嘉源', '佳滢', 
            '于涵', '于蓝', '锦云', '思淇', '予欣', '予昕', '予涵', '予弘', 
            '予磬', '予謦', '予沁', '予彤', '艳广', '梓弘', '予鑫', '佳晨', 
            '勃豪', '新辉', '思语', '雯', '一', '依涵', '顺军', '思宇', '思远', 
            '涵熙', '水生', '添翼', '治邦', '昊宇', '羽微', '佳妤', '飞龙', '子龙'                 
        ]
    }
    
    fake(schema) {
        return this._collection[this.randomIntegerInRange(0, this._collection.length - 1)];
    }
};